# Напишите программу, удаляющую из текста все слова содержащие "абв"

text = 'ujoiwvciqnmopvi абв jioawnckdkабв jioand'
text1 = text.replace('абв', '')
print (text1)