# Дан список чисел. Создать список в который попадают числа, 
# описывающие возрастающую последовательность и содержащие максимальное количество элементов. 
# Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3, 4, 6, 7]
#    [5, 2, 3, 4, 6, 1, 7] => [2, 3, 4, 6, 7]
# Порядок элементов менять нельзя

ls = [10,1,5,10] # [10, 5, 2, 3, 4, 6, 1, 7, 9, 8, 10]

def trend (st):
    ch_indx = min(st[0],st[1],st[2])
    res = [ch_indx]
    for i in range (2,len(st)):
        if st[i-2]>ch_indx and st[i-2]<max(st[i-1], st[i]):
            res.append(st[i-2])
            ch_indx = st[i-2]
        if st[i] == max(st):
            res.append(st[i])
            break
    return res
print(trend(ls))